{
  "ChIJIemoMM5uYksR4bSEmcJNHFM": {
    "about_us": "All Source Electrical & Lightning Services LLC brings top-tier electrical contracting to Adger and beyond, ranked in Alabama's top 20% of contractors with a BuildZoom score of 96. Since 2017, we've successfully completed 27+ commercial and residential projects annually, from $5k upgrades to $500k installations. Our certified technicians excel in electrical system design, energy-efficient lighting solutions, and emergency storm damage repairs, backed by 25+ years of field experience."
  },
  "ChIJf2n-H9t1uCQRUzPxaliDdqM": {
    "about_us": "Dupree Electrical brings 18 years of trusted service to Alabama homes and businesses. Specializing in energy audits, smart home integrations, and code compliance upgrades, our family-owned operation combines old-fashioned work ethic with modern electrical certifications. Recognized for eco-conscious lighting solutions and ADA-compliant installations, we maintain 24/7 emergency response capabilities across Jefferson County."
  },
  "ChIJe_IMOd8_iYgRR5T1HMOv5Bo": {
    "about_us": "JD Allen Services has been Birmingham's go-to electrical expert since 2005, offering HVAC-compatible wiring solutions and industrial maintenance programs. Our NECA-certified team handles everything from attic fan installations to commercial generator setups, with specialized expertise in historic property retrofits and solar panel integration. Committed to education, we provide free safety inspections and energy efficiency consultations."
  },
  "ChIJsaH3vGaviIgRHlomWxuPnrM": {
    "about_us": "Robinson Electrical Contractors LLC delivers precision commercial electrical services across Alabama. Founded by master electricians with 22+ years in industrial systems, we specialize in data center installations, warehouse lighting retrofits, and OSHA-compliant facility upgrades. Our UL-certified team supports businesses with arc flash studies, preventative maintenance programs, and energy management solutions."
  },
  "ChIJ_xXlEkmZYogRStM8syeqHOo": {
    "about_us": "Jeff Turner Electrical has been Trinity's trusted electrical service provider since 2008, maintaining BBB accreditation with an A+ rating since 2015. Specializing in residential and light commercial solutions, we deliver expert appliance installations, generator services, and electrical code compliance upgrades. Our owner-operated team combines 17+ years of experience with personalized service, ensuring prompt responses and meticulous attention to detail for every home wiring project and electrical repair."
  },
  "ChIJ53itrHFvgYgRg_Co6092b3A": {
    "about_us": "Moody’s Electric Service, LLC provides reliable residential and commercial electrical solutions across Alabama. Specializing in code-compliant installations and emergency repairs, our licensed team combines technical expertise with a commitment to transparent communication. Serving communities since 2015, we prioritize energy-efficient upgrades and smart home integrations tailored to modern living needs."
  },
  "ChIJ8VY1tmT_mqcRDTiPmyWnRDQ": {
    "about_us": "Resource Electrical Services, LLC delivers industrial-grade electrical contracting to Petrey and surrounding regions. Our NICET-certified technicians excel in facility maintenance, arc flash mitigation, and OSHA-compliant system retrofits. Founded in 2018, we partner with agricultural and manufacturing clients to implement cost-effective power solutions while maintaining rigorous safety standards."
  },
  "ChIJKTsNHNR9kogR0voT8l67UnM": {
    "about_us": "Reliant Electrical Solutions LLC powers Alabama homes and businesses with precision since 2020. Specializing in solar-ready panel upgrades and whole-home surge protection, our team holds NABCEP certifications for renewable energy integrations. From historic property rewiring to EV charger installations, we blend innovative technology with old-school craftsmanship."
  },
  "ChIJRbviIlcqjIgRq5SRGK9hWPo": {
    "about_us": "Longleaf Electric LLC serves Daphne and surrounding areas with versatile electrical solutions since 2021. Specializing in residential troubleshooting, commercial retrofits, and industrial maintenance, our team handles everything from exhaust fan installations to arc flash mitigation. Prioritizing code compliance and energy efficiency in every project."
  },
  "ChIJS_YPnQiBjogROmRN7Lnp2j4": {
    "about_us": "Montgomery Electrical Services has been serving the Montgomery area since 2006, providing expert residential and commercial electrical solutions. Our licensed team specializes in electrical repairs, installations, and upgrades, with a focus on energy-efficient lighting and smart home integrations. We pride ourselves on our prompt 24/7 emergency service and our commitment to safety and customer satisfaction."
  },
  "ChIJ1ZgpqqzpuCMR7892KKIHaFI": {
    "about_us": "CEH Electric Solutions, established in January 2024, brings fresh innovation to Alabama's electrical contracting landscape. Our young team combines cutting-edge technology with rigorous safety standards, specializing in both residential and commercial electrical services. From smart home installations to industrial power systems, we're committed to delivering efficient, future-proof electrical solutions for the Montgomery community."
  },
  "ChIJU11D1fEMjIgRZBnjCdWzK14": {
    "about_us": "Agee Electric, founded in 2002, has been a trusted name in Alexander City for over two decades. Led by Master Electrician Jeremiah Agee, we specialize in residential and commercial electrical work, including new construction, remodeling, and service upgrades. Our commitment to quality and safety has earned us a reputation for reliability and expertise in central Alabama's electrical services industry."
  },
  "ChIJbSw-aooKv2YRdsy_06w_feE": {
    "about_us": "Jackson Electrical Services of Alabama LLC, based in Birmingham, brings IBEW Local 136 training and expertise to residential, commercial, and industrial electrical projects. Founded by Jamille Jackson, our team excels in complex electrical installations, maintenance, and repairs. With a focus on precision and safety, we handle everything from home rewiring to large-scale industrial electrical systems, ensuring top-quality service across Alabama."
  },
  "ChIJPV1pr4uQiYgR0YXEuYQWd98": {
    "about_us": "Holcombe Electric LLC, led by Master Electrician Eric Holcombe, has been serving Oneonta and surrounding areas since 2011. With over 13 years of experience, we specialize in both residential and commercial electrical services. Our team is known for quality craftsmanship in new construction wiring, home additions, and electrical upgrades. We pride ourselves on our attention to detail and commitment to customer satisfaction in every project we undertake."
  },
  "ChIJQ7rcQot9iYgRIEfJAPFFSAg": {
    "about_us": "Ralph Electric, LLC provides certified residential and commercial electrical services across Alabama. Specializing in code-compliant installations, our licensed team focuses on energy-efficient lighting retrofits, panel upgrades, and emergency repair services. Committed to safety and transparency, we deliver tailored solutions for modern homes and small businesses while maintaining strict adherence to NEC standards."
  },
  "ChIJF0-8kZ-niYgRW_GnfFJPAhY": {
    "about_us": "Good Stewart Electric combines local expertise with certified electrical solutions for Alabama communities. Our services span whole-home rewiring, generator installations, and smart home integrations. Prioritizing safety and reliability, we offer detailed project consultations and same-day emergency response, ensuring compliance with state and local electrical codes."
  },
  "ChIJserrPLqp1EkRbqLVejiiMe0": {
    "about_us": "The Electrical Plug delivers innovative solutions for residential and light commercial clients. Specializing in EV charger installations, solar system integrations, and home automation setups, our NICET-certified technicians bridge traditional craftsmanship with emerging technologies. We focus on energy-conscious designs that align with Alabama's evolving electrical infrastructure needs."
  },
  "ChIJvxXDwGoV8GcRpF8oRVIlMCU": {
    "about_us": "Southern Home Innovative Tech, LLC modernizes Alabama properties through tech-forward electrical solutions. Our certified team excels in smart lighting systems, whole-home surge protection, and energy efficiency audits. Combining NEC compliance with sustainable practices, we help homeowners and businesses optimize power consumption while enhancing safety."
  },
  "ChIJVwTi2JSLkogRBeZowVrmK-Y": {
    "about_us": "Dr. Watts Electric Service provides comprehensive electrical care for residential and agricultural clients. Specializing in well pump installations, barn wiring, and rural grid solutions, our licensed electricians address Alabama's unique power challenges. With OSHA-compliant practices and free safety inspections, we prioritize long-term reliability over quick fixes."
  },
  "ChIJ9RtgipbZkogRCmRUacOm2hs": {
    "about_us": "Jones Johnson Electrical provides expert electrical services to the Florida Panhandle region. With a focus on residential and commercial installations, our licensed team offers comprehensive solutions from new construction wiring to energy-efficient lighting upgrades. We pride ourselves on prompt service, transparent pricing, and a commitment to exceeding electrical code standards in every project we undertake."
  },
  "ChIJI4xBmLL5kogRXpPR-lIhtRQ": {
    "about_us": "Middlebrooks Brothers, Inc. has been serving the Bonifay area since 2005 as a multi-faceted contractor. We specialize in electrical, HVAC/R, and SprayFoam services for residential, commercial, and industrial clients. Our licensed professionals handle both new construction and retrofit projects, ensuring energy efficiency and code compliance. With a focus on quality craftsmanship and customer satisfaction, we've built a reputation for reliability in Northwest Florida."
  },
  "ChIJVTA20eA6k4gRQEYmaHpN5Nc": {
    "about_us": "King Electric & Construction, LLC is a full-service electrical contractor serving Northwest Florida. Our experienced, licensed, and insured team specializes in residential and commercial electrical work, from minor repairs to complete system installations. We pride ourselves on our attention to detail, commitment to safety, and customer-first approach. Whether you need a panel upgrade, lighting installation, or emergency repairs, we're available to provide prompt and professional service."
  },
  "ChIJlVbM7youewIRWPYMW6PGMhY": {
    "about_us": "Willpower Electric, based in Red Level, AL, brings over 20 years of expertise to commercial and residential electrical services. Our team excels in efficiently diagnosing and resolving power issues without disrupting daily operations. We offer 24-hour emergency call-outs and stand behind our work with a one-year warranty. From panel upgrades to complete rewiring, we prioritize safety, efficiency, and customer satisfaction in every project we undertake."
  },
  "ChIJLXkS4WoOmogRkdUa1YYwcEg": {
    "about_us": "Island Electric Company, established in 2017, is a full-service electrical contractor serving the Gulf Shores area. Our team of licensed professionals specializes in residential, commercial, and industrial electrical work. From new construction to remodels and repairs, we offer a wide range of services including lighting design, energy-efficient upgrades, and smart home integrations. With a focus on quality workmanship and customer satisfaction, we strive to be the Gulf Coast's premier choice for all electrical needs."
  },
  "ChIJl_NJ3KIc_0oR13_u0leXbik": {
    "about_us": "Home Electrical Services provides reliable residential solutions across Alabama, specializing in code-compliant installations and emergency repairs. Our licensed technicians focus on safety and efficiency for lighting upgrades, panel maintenance, and smart home integrations, delivering tailored solutions for modern households."
  },
  "ChIJKf4sDDIPmogRm58jPgcRjAc": {
    "about_us": "Ben Clark Electrical brings certified expertise to Foley and Baldwin County since 2018, holding a BuildZoom score of 92 (top 32% in Alabama). Our licensed team handles commercial permits, residential upgrades, and energy-efficient retrofits, with 13+ permitted projects completed. Specializing in NEC-compliant installations and emergency response, we prioritize transparency and safety."
  },
  "ChIJU4IPujYJmogRZPsPymXWpMI": {
    "about_us": "Hamner Electrical Services serves Baldwin County with 24/7 residential and commercial solutions. Relocated from Tuscaloosa in 2023, our licensed team combines local knowledge with industrial-grade expertise for code-compliant installations, generator services, and smart home integrations. Committed to community-focused service and rapid emergency response."
  },
  "ChIJ16psTDf2-QwRAvupTMHRvoQ": {
    "about_us": "Master Electrical Company LLC, operating since 2008, delivers comprehensive electrical services from diagnostics to new construction. Recognized for thorough safety inspections and warranties, our NICET-certified team excels in lighting installations, marine systems, and energy audits. Serving Mobile and Baldwin counties with 15+ years of trusted expertise."
  },
  "ChIJo0qIVflk6y0RdBpBfJqmfRk": {
    "about_us": "AVAD Electrical Services LLC provides Generac-certified power solutions in Fairhope, specializing in standby generator installations and commercial electrical systems. Our licensed technicians combine energy management expertise with OSHA-compliant practices, offering storm preparedness packages and industrial-grade retrofits for Gulf Coast properties."
  },
  "ChIJvX2y2KpymogRyGT0i9K5ZJk": {
    "about_us": "Robinson Electric LLC delivers expert electrical services across Baldwin County. Specializing in marine electrical installations and storm recovery, our licensed team excels in pier wiring, boat lift systems, and code-compliant upgrades for residential and commercial waterfront properties. We combine local expertise with cutting-edge solutions to ensure safety and reliability in every project."
  },
  "ChIJpTfOcOM9mogR14GGB3o-dnU": {
    "about_us": "Southern Wiring Solutions LLC provides comprehensive electrical solutions, focusing on rural and agricultural installations. Our certified technicians handle well pump wiring, barn electrification, and energy audits while offering 24/7 emergency response across Mobile and Baldwin counties. We're committed to powering Alabama's farms and homes with safety and efficiency."
  },
  "ChIJzajK4BATmogRY1MreyG3_C8": {
    "about_us": "Lambert Home Services offers round-the-clock electrical troubleshooting and smart home integrations for Foley properties. Specializing in emergency repairs and lighting retrofits, our licensed team combines rapid response with rigorous safety protocols. We're dedicated to keeping your home or business powered, connected, and secure."
  },
  "ChIJabl3HoYTmogRXtFqk1raDuc": {
    "about_us": "Coastal Electric Services LLC brings energy-efficient solutions to Summerdale and surrounding areas. Our expertise spans solar-ready panel upgrades, pool lighting installations, and commercial retrofits. With our team of skilled electricians, we ensure every project meets the highest standards of quality and code compliance."
  },
  "ChIJKyDP5W21m4gRAK2tbyNbJ8Y": {
    "about_us": "Due South Electric specializes in marine electrical services and solar installations across Mobile. Our certified team excels in yacht wiring, dock electrification, and coastal property surge protection. With years of experience in maritime and residential projects, we deliver reliable power solutions for Alabama's coastal communities."
  },
  "ChIJM_xUzl020qoR1hH62MXi7Dc": {
    "about_us": "Ritchie Electric specializes in industrial maintenance and data center power systems for southwest Alabama. Our expert technicians deliver arc flash mitigation, 3-phase installations, and facility upgrades for manufacturing and tech-sector clients. We're committed to enhancing safety and efficiency in industrial electrical systems."
  },
  "ChIJOZI6NfY8YU0RGPpNbnyCy9c": {
    "about_us": "3 Phase Solutions brings extensive expertise in commercial motor controls and HVAC-compatible electrical systems. Serving industrial clients, we implement energy management solutions, VFD installations, and preventative maintenance programs. Our focus is on optimizing operational efficiency and reducing downtime for businesses across Alabama."
  },
  "ChIJ2Q8EoWrNiYgRECi7JHoXdQY": {
    "about_us": "D1 Electric LLC offers comprehensive residential and light commercial services across central Alabama. We specialize in smart home automation and EV charger installations, focusing on energy-conscious designs while maintaining strict adherence to safety standards. Our licensed team is dedicated to bringing modern electrical solutions to Alabama homes and businesses."
  },
  "ChIJ__K2REINjogR2DOWaH9__RM": {
    "about_us": "Family-owned JCE Electrical has powered Lapine's homes and businesses since 2001 with ASE-certified technicians. Specializing in whole-home rewiring, code compliance upgrades, and generator installations, we combine old-school craftsmanship with modern safety standards. Our 24-year legacy reflects our commitment to transparent pricing, same-day emergency service, and building lasting relationships through quality workmanship in central Alabama."
  },
  "ChIJidqiLzgPiYgR-3IUyeRj8mQ": {
    "about_us": "Bowen Electric delivers precision electrical services across Alabama, from smart home installations to commercial retrofits. Our licensed team specializes in energy-efficient lighting design, landscape lighting systems, and comprehensive electrical inspections. With deep roots in community service and EPA-recognized sustainable practices, we transform properties through innovative electrical solutions while maintaining strict adherence to NEC safety standards."
  },
  "ChIJB_K_c5UZoWsRsfg3ss7zaPg": {
    "about_us": "Whalen Electric Services has set Alabama's electrical standard since 1997, offering industrial-grade solutions for residential and commercial clients. As HBA of Louisville members, we provide Design-Build services with 1-year labor warranties on all installations. From solar-ready panel upgrades to OSHA-compliant facility wiring, our NECA-certified technicians combine 28 years of experience with cutting-edge technology for mission-critical power systems."
  }
}
